---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures
source: html/262156fe-c474-9dfe-faaf-b8e3f0409a39.htm
---
# BuiltInFailures.DesignOptionFailures Properties

Areas and Area Boundaries are not allowed in Design Options. Make an Area Scheme and an Area Plan for this Option then draw all Areas and Area Boundaries in that view.